package com.master.chapter009;

/**
 * @author ColorXJH
 * @version 1.0
 * @description 设计模式概述
 * @date 2021/2/24 16:29
 */
public class DesignPatternIntrudece {
    //设计模式是由四人帮gang of four写出的经典书籍 23中设计模式（绝大部分情况）
    //设计模式不限于某种语言，java/c++/php都有设计模式

    //设计模式分为三种类型，共23种
    //1：创建型模式：单例模式，抽象工厂模式，原型模式，建造者模式，工厂模式，
    //2：结构型模式：适配器模式，桥接模式，装饰模式，组合模式，外观模式，享元模式，代理模式
    //3：行为型模式：模板方法模式，命令模式，访问者模式，迭代器模式，观察者模式，中介者模式，备忘录模式
        //解释器模式，状态模式，策略模式，责任链模式


    //设计模式是程序员在面对同类软件工程设计问题所总结出来的有用的经验，模式不是代码，而是某类问题的通用解决方案
    //设计模式代表了最佳的实践，这些解决方案是众多开发人员经过相当长时间实验和错误总结出来的
    //设计模式的本质是提高 软件的维护性 通用性和可扩展性，并降低软件的复杂度




}
